#1
# word = "alGoriTHms"
# number = 0
# for i in word:
#     if i.isupper():
#         number +=1
#     else:
#         continue
# print(number)

# შედარების რაოდენობა არის სიტყვის სიგრძის ტოლი ხოლო ინკრემენტაცია capita letterის ტოლი ხოლო capitall letter მაქსიმალური რაოდენობა ტოლი იქნება სიტყვის სიგრძის ტოლი


#2
numbers = [1,2,3,4,5,6,7,8,9,10]
num = 0
for i in numbers:
    num += i
medium = num / len(numbers)
print(medium)

# საშუალო იქნება ამ რიცხევბის ჯამი გაყოფილი რაოდენობაზე.ამ პროგრმაში ვიყენებ for loop,ინკრემენტაციას,მინიჭებას და გაყოფის მათემატიკურ ოპერატორს.ინკრემენტაცია სრულდებაა იმდენჯერ რამდენი რიცხვიც არის listში იმას მინუს 1 ანუ n-1 ხოლო მინიჭება ხდება n + 2ჯერ ანუ რამდენჯერაც შეიცვლება ჯამი იმას პლიუს ორი.თავიდან რომ აქვს მინიჭებული 0 და მეორე როცა ვიგებთ საშუალოს

#3
#ფსევდოკოდი
largest = a
if largest < b:
    largest = b
elif largest < c:
    largest = c
return largest
# მაქსიმუმი შეიძლება იყოს ან a ან b ან c.ყვეაზე მეტი შედარება მაშინ მოხდება თუ მაქსიმუმი იყო c ხოლო ყველაზე ნაკლები მაშინ როცა მაქსიმუმი იყო a
