// 1) გააგზავნეთ მოთხოვნა fetch ის დახმარებით https://fakestoreapi.com/products ამ მისამართზე და დაბეჭდეთ დაბრუნებული მონაცემები
// fetch('https://fakestoreapi.com/products/1')
//     .then(res => res.json())
//     .then(data => console.log(data))
//     .catch(error => console.log("error"))


// 2) დახატეთ ის თუ როგორ მუშაობს კლიენტსა და სერვერს შორის ურთიერთობა

// 3) კომენტარებით ახსენით რა არის დაპირება promise ობიექტი

// promise იძლევა რაღაც გარკვეულ პირობას რომ აუცილებლად დააბრუნებს პასუხს ან დადებითს ან უარყოფითს კონკრეტულ პირობაზე დაყრდნობით

